app/Controllers/Clientes.php

    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers)&& !empty($headers['Authorization'])){

                if($request->getHeader('Authorization')=='Authorization: Basic '.base64_encode($value['cliente_id'].':'.$value['llave_secreta'])){
                    $model = new ClientesModel();
                    $cliente = $model->where('estado',1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1
SELECT *
FROM `clientes`
WHERE `estado` = 1

    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1

    public function update($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers)&& !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '.base64_encode($value['cliente_id'].':'.$value['llave_secreta'])){
                    $datos = $this->request->getRawInput();
                    if(!empty($datos)){
                        $validation->setRules([
                            "nameClient"=>'required|string|max_length[255]',
                            "direccionCli"=>'required|string|max_length[255]',
                            "correoClient"=>'required|valid_email',
                            "numberClient"=>'required|string|max_length[255]',
                            "genero"=>'required|string|max_length[255]',
                            "fechaNacimiento"=>'required|string|max_length[255]',
                            "tipodocu"=>'required|string|max_length[255]',
                            "numerodocu"=>'required|string|max_length[255]'
                        ]);
                        $validation->withRequest($this->request)->run();
                        if($validation->getErrors()){
                            $errors = $validation->getErrors();
                            $data = array("Status"=>404, "Detalle"=>$errors);
                            return json_encode($data, true);
                        }
                        else{
                            $model = new ClientesModel();
                            $cliente = $model->find($id);
---
SELECT *
FROM `registros`
WHERE `estado` = 1
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '11'