app/Controllers/Productos.php

    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1

    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1

                                        "ID_CATEGORIA"=>$datos["ID_CATEGORIA"]
                                );
                                $model = new ProductosModel();
                                $producto = $model->insert($datos);
---
INSERT INTO `productos` (`nombreproducto`, `descripcion`, `precionormal`, `preciorebajado`, `cantidad`, `imagen`, `idcategoria`) VALUES ('holii', 'kdncd', '150', '80', '12', 'kinxls', '1')