app/Controllers/Proveedores.php

    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers)&& !empty($headers['Authorization'])){

                if($request->getHeader('Authorization')=='Authorization: Basic '.base64_encode($value['cliente_id'].':'.$value['llave_secreta'])){
                    $model = new ProveedoresModel();
                    $proveedor = $model->where('estado',1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1
SELECT *
FROM `proveedores`
WHERE `estado` = 1

    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1