app/Controllers/Registros.php

    public function index(){
        $model = new RegistrosModel();
        $registro = $model->where('estado',1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1

                "llave_secreta"=>str_replace('$','o',$llave_secreta)
            );
            $model = new RegistrosModel();
            $registro = $model->insert($datos);
---
INSERT INTO `registros` (`nombres`, `apellidos`, `email`, `cliente_id`, `llave_secreta`) VALUES ('Richie Bryan', 'Valdivia Vilchez', 'richie.valdivia@upeu.edu.pe', 'a2aa07adfhdfrexfhgdfhdferttgeKg3CzfeaoZPyOzbbbHuO/Dkbr7/u55S', 'o2ao07odfhdfrexfhgdfhdferttgeBW49t2qfd4w2aslA3mmJpxFM8RTXmqi')