app/Controllers/Usuarios.php

SELECT *
FROM `registros`
WHERE `estado` = 1
---
    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

SELECT *
FROM `registros`
WHERE `estado` = 1
---
    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

INSERT INTO `usuarios` (`nombres`, `correo`, `telefono`, `dni`, `usuario`, `password`) VALUES ('bre', 'brend@upeu', '8', '659889', 'hola', 'bueno')
---
                                        "password"=>$datos["password"]
                                );
                                $model = new UsuariosModel();
                                $usuario = $model->insert($datos);