app/Models/PagosModel.php

    public function getPagos(){
        return $this->db->table('pagos c')
        ->where('c.estado',1)
        ->join('tipopago tc','c.id_tipopago = tc.idtipopago')
        ->get()->getResultArray();
---
SELECT *
FROM `pagos` `c`
JOIN `tipopago` `tc` ON `c`.`id_tipopago` = `tc`.`idtipopago`
JOIN `transferencia_pago` `cc` ON `c`.`id_transferencia` = `cc`.`idtransferenciapago`
JOIN `deposito_pago` `nc` ON `c`.`id_deposito` = `nc`.`iddepositopago`
WHERE `c`.`estado` = 1