app/Models/ProductosModel.php

SELECT *
FROM `productos` `c`
JOIN `categorias` `cc` ON `c`.`idcategoria` = `cc`.`idcategoria`
WHERE `c`.`estado` = 1
---
    public function getProductos(){
        return $this->db->table('productos c')
        ->where('c.estado',1)
        ->join('categorias cc','c.ID_CATEGORIA = cc.ID_CATEGORIA')
        ->get()->getResultArray();