app/Models/UsuariosModel.php

    public function getUsuarios(){
		return $this->db->table('usuarios c')
		->where('c.estado',1)
		->get()->getResultArray();
---
SELECT *
FROM `usuarios` `c`
WHERE `c`.`estado` = 1